{"﻿\nEbony Warren\nebony.warren.7b@gmail.com • (205) 305-0077 • ebony0wl.github.io • www.linkedin.com/in/ebony-warren • github.com/Ebony0wl\nCode2040 TECHNICAL ASESESSMENT(S)\n\tRequired Assessment: \nPlease note that students have been assured that they will not be evaluated on how long they worked on their technical assessments. This information is shown on the score reports but please do not factor it in to your hiring decisions.\nTECHNICAL SKILLS\n\tProgramming Languages: JavaScript, EJS, C++, C#, C, Java, Python, CSS, HTML, Robot-C\nWeb Frameworks: Node.js, Django, WordPress, SharePoint\nLibraries: Keras, Node.js, TensorFlow\nTools: Git, Firebase, AWS, XCode, Visual Basic, SolidWorks, Raspberry Pi\nInterests: Big Data, Machine Learning, Web Development, Artificial Intelligence, Quantum Computing, Networking\nGITHUB PROJECTS\n\t\nA search engine for Pokemon\nTechnologies: Node.JS, EJS, JavaScript\n » \nChat App for anime lovers alike\nTechnologies: Node.JS, Firebase, JavaScript\n » \nSnake Game with Bitmoji login\nTechnologies: JavaScript\nOTHER PROJECTS\n\tBuild and program a model Mars Rover using NASA documentation, for a school-year long internship.\nAcknowledged for helping many students understand the NASA documentation\nHelped set up the environment for android app controller and Raspberry Pi\nTechnologies: Python, Hand Saw, Nuts and Bolts, Android Studio\nDesigned a translator using Google and Microsoft API on a Raspberry Pi Zero, for a summer program.\nWas awarded 1  prize for dedication and problem solving skills.\nTechnologies: Python, SolidWorks\nPROFESSIONAL EXPERIENCE\nSnap Engineering Academy Scholar, Snap Inc., remote\nJuly 2020 – August 2020\nDevelop web apps and filters using Snap Kit and JavaScript\nTechnologies: JavaScript, Node.JS, Firebase, HTML, CSS, EJS\nWebsite Manager, Marketing Assistant, Robotics/Game Design Teacher, STEAM Bot Workshop , Culver City, CA\nTransferred WordPress website to new host, taught classes on robotics and game design,\nAugust 2017 – February 2020\ndeveloped strategy to reach more clients\n\nTechnologies: Java, Object C, C#, C++, Python, Unity Game Engine, Arduino, Raspberry Pi\nWeb Content Assistant, Santa Monica College, Santa Monica, CA\nAugust 2017 – May 2018\nUpdated thousands of SharePoint pages\nTechnologies: WordPress\nINVOLVEMENT\n\tMentor, Sister to Sister Program, Black Collegians/Umoja Program at Santa Monica College, Fall 2018 to Spring 2019\nMember, Alpha Gamma Sigma Honor Society, Santa Monica College, Fall 2018 to Spring 2019\n\nVolunteer, HollyShorts Film Festival, Hollywood, CA, June 2017 to July 2017\nACHIEVEMENTS\n\tFounder, President, and Captain of VEX Robotics Club\nAwarded 1  place in FitBit Challenge for the AngelHackathon, June 2018\nAwarded 1  place in the INSPIRE Program at the University of California - Irvine, July 2018\nADDITIONAL INFORMATION\n\tInterests: Playing/Making Music, Biking, Dog Walking, Hiking, Japanese Culture.\nEDUCATION\nDegree\nMajor\nInstitution\nGraduation Year\nBachelor of Science\nComputer Engineering\nUniversity of California - Santa Barbra\n2022\nAssociate of Science\nComputer Science\nSanta Monica College\n2020\nUNDERGRADUATE COURSES\nC++ Data Structures\nAssembly Language(HLA)\nIndependent Study: Machine Learning\nVisual Basic\nRESEARCH EXPERIENCE\n\tSummer Lab Assistant, Device and Research Lab, University of California - Los Angeles\nDevelp a machine learning algorithm that can recognize objects in a 3D environment\nMay 2019 – June 2019": null}